source/_posts/2017-07-13-使用-python-和-phantomjs-对网页截图.html
---
title: "使用 Python 和 Phantomjs 对网页截图"
date: 2017-07-13
layout: post
categories: Python
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">背景</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在做的一个 Web App，有个需要对 url 截图的需求，Google 了一番找到了使用 Python 和 Phantomjs 的方案，这里记录了如何使用以及遇到坑的解决方案。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">一些坑</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>中文字体展示。
</li>
<li>Phantomjs 进程无法正常退出，导致服务器卡死。
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">安装</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>使用这个 <a href="https://gist.github.com/rahularyan/ff4619c435f8bb94ef5b">Gist</a> 安装 phantomjs。
</li>
<li>使用 <code>pip install selenium</code> ，<a href="http://selenium-python.readthedocs.io/installation.html">Selenium 文档</a>。
</li>
<li>安装中文字体： <code>apt-get install xfonts-wqy ttf-wqy-microhei</code>
</li>
</ol>

<p>
<!-- more -->
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">使用</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff; font-weight: bold;">import</span> signal

<span style="color: #00ffff; font-weight: bold;">from</span> selenium <span style="color: #00ffff; font-weight: bold;">import</span> webdriver

<span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #0000ff; font-weight: bold;">screenshot</span>():
    <span style="color: #ffff00;">driver</span> = webdriver.PhantomJS()
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#35774;&#32622;&#21152;&#36733;&#39029;&#38754;&#36229;&#26102;&#26102;&#38388;</span>
    driver.set_page_load_timeout(12)
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#35774;&#32622;&#31383;&#21475;&#22823;&#23567;</span>
    driver.set_window_size(1024, 768)

    <span style="color: #00ffff; font-weight: bold;">try</span>:
       driver.get(url)
       <span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#25130;&#22270;&#20445;&#23384;&#21040;&#20869;&#23384;&#20013;&#65292;&#21518;&#32493;&#20351;&#29992; Pillow &#21387;&#32553;&#22270;&#29255;</span>
       <span style="color: #ffff00;">origin_png</span> = <span style="color: #00ffff; font-weight: bold;">self</span>.driver.get_screenshot_as_png()
    <span style="color: #00ffff; font-weight: bold;">except</span>:
       <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ff00;">''</span>
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#32467;&#26463; Phantomjs &#36827;&#31243;</span>
    <span style="color: #00ffff; font-weight: bold;">finally</span>:
       driver.service.process.send_signal(signal.SIGTERM)
       driver.<span style="color: #ff00ff;">quit</span>()
</pre>
</div>

<p>
注意事项：一定要使用 finally 语句结束 Phantomjs 释放资源
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">后续</h2>
<div class="outline-text-2" id="text-5">
<p>
目前部分国外网站无法截图，可以加上代理解决。
</p>
</div>
</div>
